MayRGSilva/ufcg-iiot-predictive-management-stm32/L4_IOT_Sensors/L4_IOT_SENSORS/Core/Src/main.c
		int max1 = min;
		float maxFrac = max - max1;
		int max2 = trunc(maxFrac * 100);


		snprintf(str_tmp2, 100, "RMS = %d.%02d\n\r", tmpInt1, tmpInt2);
		snprintf(min_temp, 100, "MIN = %d.%02d\n\r", min1,min2);
		snprintf(max_temp, 100, "MAX = %d.%02d\n\r", max1, max2);
		HAL_UART_Transmit(&huart1, (uint8_t*) str_tmp2, sizeof(str_tmp2), 1000);



		//Accelerometer Sensor
		BSP_ACCELERO_AccGetXYZ(acelerometer_value);
		int acelXInt1 = acelerometer_value[0];
		float acelXFrac = acelerometer_value[0] - acelXInt1;
		int acelXInt2 = trunc(acelXFrac * 100);

		int acelYInt1 = acelerometer_value[1];
		float acelYFrac = acelerometer_value[1] - acelYInt1;
		int acelYInt2 = trunc(acelYFrac * 100);

		int acelZInt1 = acelerometer_value[2];
		float acelZFrac = acelerometer_value[2] - acelZInt1;
		int acelZInt2 = trunc(acelZFrac * 100);

		snprintf(str_acel1, 100, " ACEL_X = %d.%02d\n\r", acelXInt1, acelXInt2);
		snprintf(str_acel2, 100, " ACEL_Y = %d.%02d\n\r", acelYInt1, acelYInt2);
		snprintf(str_acel3, 100, " ACEL_Z = %d.%02d\n\n\r", acelZInt1, acelZInt2);
		HAL_UART_Transmit(&huart1, (uint8_t*) str_acel1, sizeof(str_acel1),1000);
		HAL_UART_Transmit(&huart1, (uint8_t*) str_acel2, sizeof(str_acel2),1000);
		HAL_UART_Transmit(&huart1, (uint8_t*) str_acel3, sizeof(str_acel3),1000);


		// Criação do buffer do acelerometro x


		buf_ac[0][j] = acelerometer_value[0];
		buf_ac[1][j] = acelerometer_value[1];
		buf_ac[2][j] = acelerometer_value[2];
		j++;

		if(fullArray2){
			new_acX = valorRMS(buf_ac[0], 10);
			new_acY = valorRMS(buf_ac[1], 10);
			new_acZ = valorRMS(buf_ac[2], 10);
		}
		else{
			new_acX = valorRMS(buf_ac[0], j);
			new_acY = valorRMS(buf_ac[1], j);
			new_acZ = valorRMS(buf_ac[2], j);
		}

		if(j == 10){
			j = 0;
			fullArray2 = true;
		}

		int acx = new_acX;
		float acxFrac = acx - new_acX;
		int rmsAcx = trunc(acxFrac * 100);

		snprintf(str_acx, 100, " RMS_X = %d.%02d\n\n\r", acx, rmsAcx);


//		// Criação do buffer do acelerometro y
//
//		int buf_acY[10] = {};
//		int j = 0;
//		bool fullArray2 = false;
//		float new_acelY = 0;
//
//		p1.buf_acY[i] = temp_value;
//		i++;
//
//		if(fullArray){
//			float new_acY = valorRMS(buf_acY, 10);
//		}
//		else{
//			float new_acY = valorRMS(buf_acY,i);
//		}
//
//		if(i == 10){
//			i = 0;
//			fullArray = true;
//		}
//
//
//
//		// Criação do buffer do acelerometro z
//
//		int buf_acZ[10] = {};
//		int j = 0;
//		bool fullArray4 = false;
//		float new_acelZ = 0;
//
//		p1.buf_acZ[i] = new_acelZ;
//		i++;
//
//		if(fullArray){
//			float new_acx = valorRMS(buf_acx, 10);
//		}
//		else{
//			float new_acx = valorRMS(buf_acx,i);
//		}
//
//		if(i == 10){
//			i = 0;
//			fullArray = true;
//		}


		//Display oled i2c

		ssd1306_Fill(White);
	    ssd1306_SetCursor(0, 10);
		ssd1306_WriteString("TEMPERATURA", Font_6x8, Black);
		ssd1306_SetCursor(0, 20);
		ssd1306_WriteString(min_temp, Font_6x8, Black);
		ssd1306_SetCursor(0, 30);
		ssd1306_WriteString(max_temp, Font_6x8, Black);
		ssd1306_SetCursor(0, 40);
		ssd1306_WriteString(str_tmp2, Font_6x8, Black);
		ssd1306_UpdateScreen();
		HAL_Delay(1000);
		/*ssd1306_SetCursor(0, 10);
		ssd1306_WriteString("ACELERACAO:", Font_6x8, Black);
		ssd1306_SetCursor(0, 20);
		ssd1306_WriteString(str_acel1, Font_6x8, Black);
		ssd1306_SetCursor(0, 30);
		ssd1306_WriteString(str_acel2, Font_6x8, Black);
		ssd1306_SetCursor(0, 40);
		ssd1306_WriteString(str_acel3, Font_6x8, Black);
		ssd1306_SetCursor(0, 50);
				ssd1306_WriteString(str_acx, Font_6x8, Black);
		ssd1306_UpdateScreen();
		HAL_Delay(3000);*/

		// Interrupções

		if(1==flag){
			HAL_GPIO_TogglePin(LED_GREEN_GPIO_Port, LED_GREEN_Pin);
			min=0;
			max=0;
			HAL_Delay(1000);
			flag=0;

		}
}

	}
  /* USER CODE END 3 */


/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  if (HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1) != HAL_OK)
  {
    Error_Handler();
  }

  /** Configure LSE Drive Capability
  */
  HAL_PWR_EnableBkUpAccess();
  __HAL_RCC_LSEDRIVE_CONFIG(RCC_LSEDRIVE_LOW);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_LSE|RCC_OSCILLATORTYPE_MSI;
  RCC_OscInitStruct.LSEState = RCC_LSE_ON;
  RCC_OscInitStruct.MSIState = RCC_MSI_ON;
  RCC_OscInitStruct.MSICalibrationValue = 0;
  RCC_OscInitStruct.MSIClockRange = RCC_MSIRANGE_6;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_MSI;
  RCC_OscInitStruct.PLL.PLLM = 1;
  RCC_OscInitStruct.PLL.PLLN = 36;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV7;
  RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV2;
  RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV2;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_4) != HAL_OK)
  {
    Error_Handler();
  }

  /** Enable MSI Auto calibration
  */
  HAL_RCCEx_EnableMSIPLLMode();
}

/**
  * @brief DFSDM1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_DFSDM1_Init(void)
{

  /* USER CODE BEGIN DFSDM1_Init 0 */

  /* USER CODE END DFSDM1_Init 0 */

  /* USER CODE BEGIN DFSDM1_Init 1 */

  /* USER CODE END DFSDM1_Init 1 */
  hdfsdm1_channel1.Instance = DFSDM1_Channel1;
  hdfsdm1_channel1.Init.OutputClock.Activation = ENABLE;
  hdfsdm1_channel1.Init.OutputClock.Selection = DFSDM_CHANNEL_OUTPUT_CLOCK_SYSTEM;
  hdfsdm1_channel1.Init.OutputClock.Divider = 2;
  hdfsdm1_channel1.Init.Input.Multiplexer = DFSDM_CHANNEL_EXTERNAL_INPUTS;
  hdfsdm1_channel1.Init.Input.DataPacking = DFSDM_CHANNEL_STANDARD_MODE;
  hdfsdm1_channel1.Init.Input.Pins = DFSDM_CHANNEL_FOLLOWING_CHANNEL_PINS;
  hdfsdm1_channel1.Init.SerialInterface.Type = DFSDM_CHANNEL_SPI_RISING;
  hdfsdm1_channel1.Init.SerialInterface.SpiClock = DFSDM_CHANNEL_SPI_CLOCK_INTERNAL;
  hdfsdm1_channel1.Init.Awd.FilterOrder = DFSDM_CHANNEL_FASTSINC_ORDER;
  hdfsdm1_channel1.Init.Awd.Oversampling = 1;
  hdfsdm1_channel1.Init.Offset = 0;
  hdfsdm1_channel1.Init.RightBitShift = 0x00;
  if (HAL_DFSDM_ChannelInit(&hdfsdm1_channel1) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN DFSDM1_Init 2 */

  /* USER CODE END DFSDM1_Init 2 */

